[
  {
    "title": "Charming Victorian Terrace with Garden",
    "description": "Step into history with this beautifully maintained three-story Victorian terrace. Features original hardwood floors, high ceilings, a modern chef's kitchen, and a secluded rear garden. Located on a quiet, tree-lined street, minutes from public transport."
  },
  {
    "title": "Modern Loft Living near Downtown Core",
    "description": "Sleek, open-concept loft unit featuring polished concrete floors, 18-foot ceilings, and oversized industrial windows with stunning city views. Includes one secured underground parking spot and access to a rooftop patio."
  },
  {
    "title": "Family Oasis: 4 Bed/3 Bath in Top School District",
    "description": "Perfect family home! This spacious ranch features four bedrooms, three updated bathrooms, a finished basement, and a large, fenced backyard ideal for children and pets. Highly sought-after location near top-rated schools."
  },
  {
    "title": "Cozy Starter Condo with Low HOA Fees",
    "description": "An excellent opportunity for first-time buyers. This bright one-bedroom, one-bath unit offers a functional layout, in-unit laundry, and is conveniently located close to major shopping centres and highways. Pet-friendly building."
  },
  {
    "title": "Luxury Penthouse with Panoramic Ocean Views",
    "description": "Experience unparalleled luxury in this top-floor residence. Private elevator access, floor-to-ceiling glass walls, and a massive wrap-around terrace overlooking the coast. Custom smart-home technology and five-star amenities included."
  },
  {
    "title": "Rustic Cabin Retreat on 5 Private Acres",
    "description": "Escape the city to this serene log cabin nestled deep in the woods. Features a stone fireplace, large front porch, and access to nearby hiking trails. Ideal for nature lovers or as a weekend rental investment."
  },
  {
    "title": "Newly Built Townhome: Contemporary Finishes",
    "description": "Brand new construction! Three-bedroom, two-and-a-half-bath townhome with a single-car garage. Kitchen boasts quartz countertops and stainless steel appliances. Energy-efficient design in a rapidly developing community."
  },
  {
    "title": "Historic Tudor Revival in Exclusive Neighbourhood",
    "description": "A rare gem! This magnificent Tudor home retains its original charm with exposed beams and leaded glass windows, paired with fully updated systems. Features a grand entry and a detached two-car garage."
  },
  {
    "title": "Investor Special: Duplex with High Rental Income",
    "description": "Turnkey investment property offering two separate, well-maintained units (2 bed/1 bath each). Separate meters and leases in place. High occupancy rate in a desirable rental area. Great cash flow potential."
  },
  {
    "title": "Sun-Drenched Studio Steps from the Beach",
    "description": "Affordable coastal living! Compact, efficient studio apartment located just a block from the boardwalk. Perfect for a vacation getaway or a minimalist lifestyle. Low maintenance and quick closing possible."
  },
  {
    "title": "Expansive Equestrian Property with Barn",
    "description": "Over 10 acres of usable land with a fully equipped eight-stall barn, paddock, and riding arena. The main house is a well-kept three-bedroom farmhouse. Perfect setup for horse enthusiasts."
  },
  {
    "title": "Renovator's Dream: Solid Bones, Needs TLC",
    "description": "Priced to sell! This three-bedroom bungalow is structurally sound but requires cosmetic updates. A fantastic opportunity to customize your dream home in an established, quiet neighbourhood."
  },
  {
    "title": "Mid-Century Modern with Pool and Patio",
    "description": "Iconic architectural style with clean lines and abundant natural light. Features include a sparkling in-ground pool, a large covered patio for entertaining, and original vintage tile work. Located in a sought-after cul-de-sac."
  },
  {
    "title": "High-Rise Condo with Full Amenities and Security",
    "description": "Enjoy the convenience of city life with 24-hour security, concierge services, a gym, and a communal lounge. This two-bedroom unit features in-suite laundry and a private balcony overlooking the park."
  },
  {
    "title": "Move-In Ready Ranch near Golf Course",
    "description": "Impeccably maintained single-story ranch home. Features an open-plan living area, a newly updated kitchen with granite counters, and a spacious two-car garage. Just a short walk to the local country club."
  },
  {
    "title": "Lakefront Home with Private Dock and Boathouse",
    "description": "Your year-round vacation spot! This spacious four-bedroom home offers direct lake access, a private dock, and a fully functional boathouse. Enjoy incredible sunset views from the expansive deck."
  },
  {
    "title": "Urban Semi-Detached with Rooftop Terrace",
    "description": "Stylish semi-detached home spread over four levels. Features a gourmet kitchen, an attached garage, and a stunning, private rooftop terrace perfect for summer gatherings. Excellent walk score."
  },
  {
    "title": "Affordable Manufactured Home in 55+ Community",
    "description": "Relaxed living awaits! This well-kept manufactured home is located in a quiet, age-restricted community. Includes access to a clubhouse, pool, and organised social activities. Low lot rent."
  },
  {
    "title": "Executive Estate on Acreage with Gated Entry",
    "description": "A truly private retreat. Custom-built mansion set on rolling hills, accessed via a private, gated driveway. Features a grand foyer, indoor cinema room, and luxury finishes throughout."
  },
  {
    "title": "Bright and Airy Bungalow with Basement Suite Potential",
    "description": "Versatile property with a separate entrance to the partially finished basement, offering great income potential. The main floor is bright, with large windows and a newly painted interior."
  }
]